package lessons.lesson13.practice

fun main() {

    val food = mapOf(
        "Овощи" to listOf("Картофель", "Морковь", "Лук"),
        "Фрукты" to listOf("Яблоки", "Груши", "Апельсины"),
        "Ягоды" to listOf("Виноград", "Клубника", "Голубика"),
        "Орехи" to listOf("Арахис", "Фундук", "Макадамия"),
        "Зелень" to listOf(),
    )

//1. Создай переменную без указания типа и присвой ей значение по ключу
//"Овощи". Объясни какой тип переменной должен быть.

    val ex1: List<String>? = food["Овощи"]

//2. Выведи данные в виде "Ключ: Значение1, Значение2" используя цикл
//for а потом функцию forEach.

    food.forEach { (key, value) ->
        println("$key: ${value.joinToString(", ")}")
    }

//3. Создай not nullable переменную типа List<String> и присвой ей
//значение по ключу "Фрукты".

    val fruits: List<String> = food.getValue("Фрукты")

//4. Создай not nullable переменную типа List<String> и присвой ей значение
//по ключу "Крупы". Используй в качестве значения по умолчанию пустой
//список, если ключа нет.

    val grains: List<String> = food.getOrDefault("Крупы", listOf())

//5. Создай not nullable переменную типа List<String> и присвой ей значение
//по ключу "Рыба". Если ключа нет, нужно вывести в консоль сообщение об
//отсутствии ключа и присвоить переменной пустой список.

    val fish: List<String> = food.getOrElse("Рыба") {
        println("Ключ не найден")
        listOf() //и это будет результат работы при использовании лямбда-функции
    }

//6. Выведи сообщение "Продукты для вегетарианца" если в словаре нет ключей
//"Мясо" и "Рыба"
//7. Преобразуй словарь в список строк типа "Ключ: [значение1, значение2]"
//8. Преобразуй ключи словаря путём добавления порядкового номера, чтобы
//получилось "1. Овощи", "2. Фрукты" и так далее
//9. Преобразуй значения словаря в среднюю длину строк списка
//10. Выведи сообщение "Продуктов нет" если словарь пуст
//11. Выведи сообщение "Не все категории заполнены", если есть хотя-бы один
//пустой список в значениях. Реализуй для методов all и any
//12. Отфильтруй словарь по ключам, начинающихся с буквы "О"
//13. Отфильтруй словарь так, чтобы в списке продуктов был хотя бы один
//начинающийся на "А". Методы any и all можно применять к коллекциям
//14. Посчитай количество ключей, значения которых содержат слова с буковой
//"д"
//15. Создай новый словарь из food в котором нет орехов
//16. Преобразуй в изменяемый словарь и добавь в него мясо
//17. Удали из этого изменяемого словаря фрукты и ягоды
}