package lessons.lesson08.homework

fun main() {
uppercase()
}
//7. Все слова с большой буквы
//Напишите метод, который преобразует строку из нескольких слов
//в строку, где каждое слово начинается с заглавной буквы, а все
//остальные - строчные. Используй перебор, анализ символов и
//замену букв на заглавную с помощью метода uppercase() для
//конкретной буквы.

fun uppercase () {
    val originalPhrase = "Мама мыла раму и окно"
    var finalPhrase = ""
    val words = originalPhrase.split (" ")
    for (word in words) {
        finalPhrase += word[0].uppercase()
        finalPhrase += word.substring(1).lowercase() + " "
    }
    println (finalPhrase.trim())
}

//
//8. Игра в разведчика
//Напишите шифратор/дешифратор для строки. Шифровка производится
//путём замены двух соседних букв между собой: Kotlin шифруется
//в oKltni. Дешифровка выполняется аналогично.
//
//Если длина строки - нечётная, в конец добавляется символ
//пробела до начала шифрования. Таким образом все шифрованные
//сообщения будут с чётной длинной. Должно получиться два
//публичных метода: encrypt() и decrypt() которые принимают
//строку и печатают результат в консоль.
//
//9. Таблица умножения
//Напишите функцию, которая принимает два числа и выводит таблицу
//умножения, у которой в заголовках столбцов и строк находятся
//перемножаемые числа, а в перекрестии заголовка и столбца -
//результат перемножения. Важно: каждый столбец должен быть
//выровнен по правому краю с помощью шаблона с форматированием
//строк. Размер форматирования каждой строки нужно вычислять
//динамически для каждого столбца. Результат должен быть похож
//на этот пример:
//
//Таблица умножения