package lessons.lesson11.homework

fun main() {
    isEven(8)
    printNumbersUntil(6)
    printNumbersUntil(-3)
    findFirstNegative(listOf(1, 8, -10, 6))
    findFirstNegative(listOf(5, 13, 18, 23))
}

//Задачи на сигнатуру метода
//Напишите сигнатуру метода в которую входит модификатор доступа,
//название функции, список аргументов с типами и возвращаемое значение.
//В теле метода можешь сделать возврат объекта нужного типа если это
//требуется для устранения ошибок.
//
//1. Не принимает аргументов и не возвращает значения.

fun ex1() {

}

//2. Принимает два целых числа и возвращает их сумму.

fun ex2(a: Int, b: Int): Int = a + b

//3. Принимает строку и ничего не возвращает.

fun ex3(a: String) {

}

//4. Принимает список целых чисел и возвращает среднее значение типа Double.

fun ex4(a: List<Int>): Double {
    return 2.8
}

//5. Принимает nullable строку и возвращает её длину в виде nullable целого
//числа и доступна только в текущем файле.

private fun ex5(a: String?): Int? {
    return 5
}

//6. Не принимает аргументов и возвращает nullable вещественное число.

fun ex6(): Float? {
    return 8F
}

//7. Принимает nullable список целых чисел, не возвращает значения и
//доступна только в текущем файле.

private fun ex7(a: List<Int?>) {

}

//8. Принимает целое число и возвращает nullable строку.

fun ex8(a: Int): String? {
    return ""
}

//9. Не принимает аргументов и возвращает список nullable строк.

fun ex9(): List<String?> {
    return listOf("")
}

//10. Принимает nullable строку и nullable целое число и возвращает nullable
//булево значение.

fun ex10(a: String?, b: Int?): Boolean? {
    return true
}

//Задачи на написание кода
//Напишите валидную сигнатуру метода а так же рабочий код для задач.
//
//11. Напишите функцию multiplyByTwo, которая принимает целое число и
//возвращает его, умноженное на 2.

fun multiplyByTwo(a: Int): Int = a * 2

//12. Создайте функцию isEven, которая принимает целое число и возвращает true,
//если число чётное, и false в противном случае.

fun isEven(a: Int): Boolean {
    return a % 2 == 0
}

//13. Напишите функцию printNumbersUntil, которая принимает целое число n и
//выводит на экран числа от 1 до n. Если число n меньше 1, функция должна
//прекратить выполнение с помощью return без вывода сообщений.

fun printNumbersUntil(n: Int) {
    for (i in 1..n) println(i)
    if (n < 1) return
}

//14. Создайте функцию findFirstNegative, которая принимает список целых
//чисел и возвращает первое отрицательное число в списке. Если отрицательных
//чисел нет, функция должна вернуть null.

fun findFirstNegative(a: List<Int>): Int? {
    for (i in a) {
        if (i < 0) return i
    }
    return null
}

//15. Напишите функцию processList, которая принимает список строк. Функция
//должна проходить по списку и выводить каждую строку. Если встречается
//null значение, функция должна прекратить выполнение с помощью return
//без возврата значения.
//
//fun processList

