package lessons.lesson12.homework

import kotlin.time.measureTime

fun main() {
    val tests = listOf(
        listOf(),
        listOf(1, 2, 3, 4),
        listOf(0, 7, 6, 97, 101),
        listOf(900, 1001, 3100, 2000, 3000),
        listOf(15, 5, 13, 7, 11, 9),
        listOf(1, 3, 5, -8, 90, -18),
        listOf(-605, -9001, -11, -78, -74),
        listOf(8054, 1003, 6789, 4093, 8906),
        listOf(91, 865, 3, 84, 14),
        listOf(7, 8, 9, 11, 12)
    )
    tests.forEach { println("$it -> ${description(it)}") }

    val listGrades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    println(grades(listGrades))

    val myCatalog = listOf(
        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф",
        "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы",
        "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка",
        "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван",
        "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка",
        "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка",
        "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
        "Корзина для белья", "посуда", "Настольная лампа", "торшер",
        "Этажерка"
    )

    for ((letter, words) in catalog(myCatalog)) {
        println("$letter: $words")
    }

    println("Каталог: ${catalog(myCatalog)}")


    val list = listOf(
        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф",
        "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы",
        "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка",
        "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван",
        "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка",
        "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка",
        "Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
        "Корзина для белья", "посуда", "Настольная лампа", "торшер",
        "Этажерка"
    )
    println(averageLength(list))
    println(uniqueNumbers(listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)))
    println(findAge(listOf(22, 18, 30, 45, 17, null, 60), 18))
    println(findAge1(listOf(22, 18, 30, 45, 17, null, 60), 18))
    size()
    checkEmpty()
    checkNotEmpty()
    takeElement()
    joining()
    sumCount()
    processing()
}

//Задачи на приведение коллекции к значению
//1. Проверить, что размер коллекции больше 5 элементов.

fun size() {
    println(listOf<Int>().size > 5)
}

//2. Проверить, что коллекция пустая

val ex1 = listOf<String>("meercat", "elephant", "mouse")

fun checkEmpty() {
    println(ex1.isEmpty())
}

//3. Проверить, что коллекция не пустая

fun checkNotEmpty() {
    println(ex1.isNotEmpty())
}

//4. Взять элемент по индексу или создать значение если индекса не существует

fun takeElement(list: List<String> = listOf("Beatles", "Abba", "Queen")) {
    println(list.getOrElse(2) { "Abba" })
}

//5. Собрать коллекцию в строку

fun joining() {
    println(ex1.joinToString())
}

//6. Посчитать сумму всех значений

val ex2 = listOf(1, 7, 25)
fun sumCount() {
    println(ex2.sum())


//7. Посчитать среднее

    println(ex2.average())

//8. Взять максимальное число

    println(ex2.maxOrNull())

//9. Взять минимальное число

    println(ex2.minOrNull())

//10. Взять первое число или null

    println(ex2.firstOrNull())

//11. Проверить что коллекция содержит элемент

    println(ex1.contains("meercat"))
    println("meercat" in ex1)
}

//Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.

//Задачи на обработку коллекций
//12. Отфильтровать коллекцию по диапазону 18-30

fun processing() {

    println(ex2.filter { it in 18..30 })

//13. Выбрать числа, которые не делятся на 2 и 3 одновременно

   println(ex2.filterNot { it % 2 == 0 && it % 3 == 0 })

//14. Очистить текстовую коллекцию от null элементов

    println(ex2.filterNotNull())

//15. Преобразовать текстовую коллекцию в коллекцию длин слов

    ex1.map {it.length}

//16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
//17. Отсортировать список в алфавитном порядке
//18. Взять первые 3 элемента списка
//19. Распечатать квадраты элементов списка
//20. Группировать список по первой букве слов
//21. Очистить список от дублей
//22. Отсортировать список по убыванию
//23. Взять последние 3 элемента списка

}

//Реши задачи ниже в отдельных функциях.
//
//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку
//с характеристикой коллекции используя конструкцию when
//
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна
//20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток

fun description(list: List<Int>): String {
    return when {
        list.isEmpty() -> "Пусто"
        list.size < 5 -> "Короткая"
        list[0] == 0 -> "Стартовая"
        list.sum() > 10000 -> "Массивная"
        list.average() == 10.0 -> "Сбалансированная"
        list.joinToString().length == 20 -> "Клейкая"
        list.max() < -10 -> "Отрицательная"
        list.min() > 1000 -> "Положительная"
        list.contains(3) && list.contains(14) -> "Пи***тая"
        else -> "Уникальная"
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список
//чисел.
//
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50,
//42, 12)
//
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать
//оставшиеся по возрастанию и взять первые 3. Вызывай методы обработки
//и фильтрации последовательно один из другого, чтобы результат
//предыдущего метода являлся основой для следующего.

fun grades(listGrades: List<Int>): List<Int> {
    val result = listGrades.filter { it >= 60 }.sorted().take(3)
    return result
}

//
//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь
//с ключом - буквой и значением - списком строк.
//
//Начальные значения: val list = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф",
//"часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы",
//"Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка",
//"Подставка", "телевизор", "Комод", "полка", "Абажур", "диван",
//"Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка",
//"Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка",
//"Настенные часы", "подсвечник", "Журнальный столик", "сувенир",
//"Корзина для белья", "посуда", "Настольная лампа", "торшер",
//"Этажерка")

fun catalog(myCatalog: List<String>): Map<Char, List<String>> {
    val a = myCatalog.map { it.lowercase() }.groupBy { it.first() }
    return a
//    val result = mutableMapOf<Char, MutableList<String>>()
//    for (word in myCatalog) {
//        val letter = word.first().uppercaseChar()
//        val words = result[letter]
//        if (words != null) {
////            val newList = listOf(word) + words
////            result[letter] = newList
//            words.add(word)
//        } else {
//            result[letter] = mutableListOf(word)
//        }
//    }
//
//    return result
}

//
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать
//в каталог по первой букве используя метод groupBy
//
//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//
//Начальные значения взять из предыдущей задачи.
//
//Цель: Перевести все слова в количество букв, подсчитать среднее
//значение. Вернуть форматированный текст с двумя знаками после запятой,
//используя функцию format и подходящий шаблон.

fun averageLength(words: List<String>): String {
    val average = words.map { it.length }.average()
    return "Средняя длина слова: %.2f".format(average)
}

//
//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь
//с ключами - строками и значениями - список чисел.
//
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//
//Цель: Отобрать уникальные числа, отсортировать по убыванию и
//сгруппировать по четности (“четные” и “нечетные”).

fun uniqueNumbers(numbers: List<Int>): Map<String, List<Int>> {
    return numbers.distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}

//
//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает
//nullable число.
//
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60)
//и число для проверки возраста, например 18.
//
//Цель: Найти первый возраст в списке, который соответствует условию
//(больше второго аргумента) и вернуть его, либо null если значения
//не нашлось.

fun findAge(ages: List<Int?>, reference: Int): Int? {
//    for (age in ages) {
//        if (age == null) {
//            continue
//        }
//        if (age > reference) {
//            return age
//            }
//    }
//    return null
    return ages.filterNotNull().firstOrNull { it > reference }
}

fun findAge1(ages: List<Int?>, reference: Int): Int? {
    return ages.firstOrNull() { it !== null && it > reference }
}